Adopciones/app/Controllers/AdopcionesController.php

SELECT *
FROM `adopcion`
---
    public function mostrar()
    {

        $adopcionesModel = model('AdopcionesModel');
        $data['adopciones'] = $adopcionesModel->findAll();

SELECT *
FROM `adopcion`
WHERE `idAdoptador` LIKE '%4%' ESCAPE '!'
AND  `idMascota` LIKE '%%' ESCAPE '!'
SELECT *
FROM `mascota`
SELECT *
FROM `adoptador`
SELECT *
FROM `adopcion`
---
    public function buscar()
    {
        $adopcionModel = model('AdopcionesModel');
        $mascotaModel = model('MascotaModel');
        $adoptadorModel =model('AdoptadorModel');

        if (isset($_GET['idAdoptador'])) {
            $idAdoptador = $_GET['idAdoptador'];
            $idMascota = $_GET['idMascota'];
            $data['adopciones'] = $adopcionModel->like('idAdoptador', $idAdoptador)->like('idMascota',$idMascota)->findAll();
            $data['mascotas'] = $mascotaModel->findAll();
            $data['adoptadores'] = $adoptadorModel->findAll();
        } else {
            $idAdoptador = "";
            $data['adopciones'] = $adopcionModel->findAll();
            $data['adoptadores'] = $adoptadorModel->findAll();
            $data['mascotas'] = $mascotaModel->findAll();