Adopciones/app/Controllers/AdoptadorController.php

    public function buscar()
    {
        $adoptadorModel = model('AdoptadorModel');
        if (isset($_GET['nombre'])) {
            $nombre = $_GET['nombre'];
            $edad = $_GET['edad'];
            $data['adoptadores'] = $adoptadorModel->like('nombre', $nombre)->like('edad',$edad)->findAll();
---
SELECT *
FROM `adoptador`
WHERE `nombre` LIKE '%p%' ESCAPE '!'
AND  `edad` LIKE '%%' ESCAPE '!'