Adopciones/app/Controllers/AdopcionesController.php

UPDATE `adopcion` SET `idAdoptador` = '2', `idMascota` = '15', `fechaAdopcion` = '2023-10-12', `estatus` = 'En revision'
WHERE `adopcion`.`idAdopcion` IN ('3')
---
    public function update()
    {
        $adopcionModel = model('AdopcionesModel');
        $data = [
            "idAdoptador" => $_POST['idAdoptador'],
            "idMascota" => $_POST['idMascota'],
            "fechaAdopcion" => $_POST["fechaAdopcion"],
            "estatus" => $_POST['estatus']
        ];
        $adopcionModel->update($_POST['idAdopcion'], $data);

SELECT *
FROM `adopcion`
WHERE `adopcion`.`idAdopcion` = '11'
SELECT *
FROM `mascota`
SELECT *
FROM `adoptador`
---
    public function editar($idAdopcion)
    {
        $adopcionModel = model('AdopcionesModel');
        $mascotaModel = model('MascotaModel');
        $adoptadorModel = model('AdoptadorModel');
        $data['adopcion'] = $adopcionModel->find($idAdopcion);
        $data['mascotas'] = $mascotaModel->findAll();
        $data['adoptadores'] = $adoptadorModel->findAll();