Adopciones/app/Controllers/DietaController.php

    public function mostrar()
    {
        $dietaModel = model('DietaModel');
        $data['dietas'] = $dietaModel->findAll();
---
SELECT *
FROM `dieta`