Adopciones/app/Controllers/MascotaController.php

SELECT *
FROM `mascota`
WHERE `nombre` LIKE '%%' ESCAPE '!'
AND  `sexo` LIKE '%%' ESCAPE '!'
AND  `animal` LIKE '%%' ESCAPE '!'
AND  `edad` LIKE '%%' ESCAPE '!'
AND  `color` LIKE '%%' ESCAPE '!'
AND  `tamanio` LIKE '%%' ESCAPE '!'
AND  `peso` LIKE '%%' ESCAPE '!'
SELECT *
FROM `raza`
WHERE `idRaza` LIKE '%10%' ESCAPE '!'
SELECT *
FROM `dieta`
WHERE `idDieta` LIKE '% %' ESCAPE '!'
SELECT *
FROM `mascota`
SELECT *
FROM `raza`
SELECT *
FROM `dieta`
---
    public function buscar()
    {
        $mascotaModel = model('MascotaModel');
        $razaModel = model('RazaModel');
        $dietaModel = model('DietaModel');

        if (isset($_GET['nombre'])) {
            $nombre = $_GET['nombre'];
            $animal = $_GET['animal'];
            $sexo = $_GET['sexo'];
            $edad = $_GET['edad'];
            $color = $_GET['color'];
            $tamanio = $_GET['tamanio'];
            $peso = $_GET['peso'];
            $idRaza = $_GET['idRaza'];
            $idDieta = $_GET['idDieta'];

            $data['mascotas'] = $mascotaModel
                ->like('nombre', $nombre)
                ->like('sexo', $sexo)
                ->like('animal', $animal)
                ->like('edad', $edad)
                ->like('color', $color)
                ->like('tamanio', $tamanio)
                ->like('peso', $peso)
                ->findAll();
                $data['razas'] = $razaModel->like('idRaza',$idRaza)->findAll();
                $data['dietas'] = $dietaModel->like('idDieta', $idDieta)->findAll();
        } else {
            $nombre = "";
            $data['mascotas'] = $mascotaModel->findAll();
            $data['razas'] = $razaModel->findAll();
            $data['dietas'] = $dietaModel->findAll();