Adopciones/app/Controllers/MascotaController.php

SELECT *
FROM `mascota`
SELECT *
FROM `dieta`
SELECT *
FROM `raza`
---
    public function mostrar()
    {
        $dietaModel = model("DietaModel");
        $razaModel = model("RazaModel");
        $mascotasModel = model('MascotaModel');
        $data['mascotas'] = $mascotasModel->findAll();
        $data['dietas'] = $dietaModel->findAll();
        $data['razas'] = $razaModel->findAll();

SELECT *
FROM `mascota`
WHERE `mascota`.`idMascota` = '14'
SELECT *
FROM `dieta`
SELECT *
FROM `raza`
---
    public function editar($idMascota)
    {
        $mascotaModel = model('MascotaModel');
        $razaModel = model('RazaModel');
        $dietaModel = model('DietaModel');
        $data['mascota'] = $mascotaModel->find($idMascota);
        $data['dietas'] = $dietaModel->findAll();
        $data['razas'] = $razaModel->findAll();

SELECT *
FROM `dieta`
SELECT *
FROM `raza`
---
    public function agregar(){
        $dietaModel = model('DietaModel');
        $razaModel = model('RazaModel');

        $data['dietas'] = $dietaModel->findAll();
        $data['razas'] = $razaModel->findAll();

DELETE FROM `mascota`
WHERE `idMascota` IN ('30')
---
    public function delete($idMascota)
    {
        $mascotaModel = model('MascotaModel');
        $mascotaModel->delete($idMascota);

SELECT *
FROM `mascota`
WHERE `nombre` LIKE '%%' ESCAPE '!'
AND  `sexo` LIKE '%%' ESCAPE '!'
AND  `animal` LIKE '%%' ESCAPE '!'
AND  `edad` LIKE '%%' ESCAPE '!'
AND  `color` LIKE '%%' ESCAPE '!'
AND  `tamanio` LIKE '%%' ESCAPE '!'
AND  `peso` LIKE '%%' ESCAPE '!'
AND  `idRaza` LIKE '%%' ESCAPE '!'
AND  `idDieta` LIKE '%2%' ESCAPE '!'
SELECT *
FROM `raza`
SELECT *
FROM `dieta`
SELECT *
FROM `mascota`
---
    public function buscar()
    {
        $mascotaModel = model('MascotaModel');
        $razaModel = model('RazaModel');
        $dietaModel = model('DietaModel');

        if (isset($_GET['nombre'])) {
            $nombre = $_GET['nombre'];
            $animal = $_GET['animal'];
            $sexo = $_GET['sexo'];
            $edad = $_GET['edad'];
            $color = $_GET['color'];
            $tamanio = $_GET['tamanio'];
            $peso = $_GET['peso'];
            $idRaza = $_GET['idRaza'];
            $idDieta = $_GET['idDieta'];

            $data['mascotas'] = $mascotaModel
                ->like('nombre', $nombre)
                ->like('sexo', $sexo)
                ->like('animal', $animal)
                ->like('edad', $edad)
                ->like('color', $color)
                ->like('tamanio', $tamanio)
                ->like('peso', $peso)
                ->like('idRaza',$idRaza)
                ->like('idDieta', $idDieta)
                ->findAll();
                $data['razas'] = $razaModel->findAll();
                $data['dietas'] = $dietaModel->findAll();
        } else {
            $nombre = "";
            $data['mascotas'] = $mascotaModel->findAll();
            $data['razas'] = $razaModel->findAll();
            $data['dietas'] = $dietaModel->findAll();

INSERT INTO `mascota` (`nombre`, `edad`, `sexo`, `color`, `tamanio`, `peso`, `idRaza`, `idDieta`) VALUES ('Merlín', '1', 'Macho', 'Morado', '5', '1', '5', '2')
---
    public function insertar()
    {
        $mascotaModel = model('MascotaModel');
        $data = [
            "animal" => $_POST['animal'],
            "nombre" => $_POST['nombre'],
            "edad" => $_POST["edad"],
            "sexo" => $_POST['sexo'],
            'color' => $_POST['color'],
            'tamanio' => $_POST['tamanio'],
            'peso' => $_POST['peso'],
            'idRaza' => $_POST['idRaza'],
            'idDieta' => $_POST['idDieta']
        ];
        $mascotaModel->insert($data, false);

UPDATE `mascota` SET `nombre` = 'Ronnie', `edad` = '6234324', `sexo` = 'Macho', `color` = 'Marrón', `tamanio` = '10222', `peso` = '52222', `idRaza` = '4', `idDieta` = '4'
WHERE `mascota`.`idMascota` IN ('14')
---
    public function update()
    {
        $mascotaModel = model('MascotaModel');
        $data = [
            "animal" => $_POST['animal'],
            "nombre" => $_POST['nombre'],
            "edad" => $_POST["edad"],
            "sexo" => $_POST['sexo'],
            'color' => $_POST['color'],
            'tamanio' => $_POST['tamanio'],
            'peso' => $_POST['peso'],
            'idRaza' => $_POST['idRaza'],
            'idDieta' => $_POST['idDieta']
        ];
        $mascotaModel->update($_POST['idMascota'], $data);