Adopciones/app/Controllers/MascotaController.php

SELECT *
FROM `mascota`
WHERE `nombre` LIKE '%%' ESCAPE '!'
AND  `sexo` LIKE '%Macho%' ESCAPE '!'
SELECT *
FROM `mascota`
---
    public function buscar()
    {
        $mascotaModel = model('MascotaModel');
        if (isset($_GET['nombre'])) {
            $nombre = $_GET['nombre'];
            $sexo = $_GET['sexo'];
            $data['mascotas'] = $mascotaModel->like('nombre', $nombre)->like('sexo',$sexo)->findAll();
        } else {
            $nombre = "";
            $data['mascotas'] = $mascotaModel->findAll();