Adopciones/app/Controllers/RazaController.php

    public function buscar()
    {
        $razaModel = model('RazaModel');
        if (isset($_GET['nombre'])) {
            $nombre = $_GET['nombre'];
            $descripcion = $_GET['descripcion'];
            $data['razas'] = $razaModel->like('nombre', $nombre)->like('descripcion',$descripcion)->findAll();
        } else {
            $nombre = "";
            $data['razas'] = $razaModel->findAll();
---
SELECT *
FROM `raza`